*** select * from playerz;
#+BEGIN_SRC sql :engine postgresql :database tourney_practice
select * from playerz;
#+END_SRC

#+RESULTS:
| player_id | player_name | tournament_name |
|-----------+-------------+-----------------|
*** select * from match_participants
#+BEGIN_SRC sql :engine postgresql :database tourney_practice
select * from match_participants
#+END_SRC

#+RESULTS:
| match_id | home | away |
|----------+------+------|
*** select * from matchez
#+BEGIN_SRC sql :engine postgresql :database tourney_practice
select * from matchez
#+END_SRC

#+RESULTS:
| match_id | tournament_name | round |
|----------+-----------------+-------|
*** select * from score_results
#+BEGIN_SRC sql :engine postgresql :database tourney_practice
select * from score_results
#+END_SRC

#+RESULTS:
| match_id | home_score | away_score |
|----------+------------+------------|
*** select * from player_recordz
#+BEGIN_SRC sql :engine postgresql :database tourney_practice
select * from player_recordz
#+END_SRC

#+RESULTS:
| player_id | wins | losses | draws | points | omw |
|-----------+------+--------+-------+--------+-----|
**** calling log_records will update player_recordz each time (returns VOID)
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
select * from log_records(2, 'tennis')
 #+END_SRC

 #+RESULTS:
 | log_records |
 |-------------|
 |             |
**** select * from players_matches(1) 
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
select * from players_matches(12)
 #+END_SRC

 #+RESULTS:
 | opposing_player |
 |-----------------|
 |                 |
 |                 |
 |                 |
 |                 |
 |                 |
 |                 |
 |                 |
 |                 |
 |                 |
 |                 |
 |                 |
 |                 |
 |                 |
 |              11 |
 |                 |
 |                 |
 |                 |
 |              16 |
 |                 |
 |                 |
 |                 |
 |              13 |
 |                 |
 |                 |
**** select * from player_OMW(1)
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
select * from player_OMW(1)
 #+END_SRC

 #+RESULTS:
 | opponent | opponent_omw |
 |----------+--------------|
 |        1 |           15 |
 |        7 |            0 |
 |        6 |            6 |
**** select * from set_omw(1) (UPDATES player_recordz; returns VOID)
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
select * from set_omw(1)


 #+END_SRC

 #+RESULTS:
 | set_omw |
 |---------|
 |         |
